Repository: mozilla-l10n/mt-training-data
Catalog: co/co_pontoon.tmx
Source language: en_us
Languages: co

source: Link you copied: %@
co: Liame cupiatu : %@

source: Lock %@ when a site is open:
co: Ammarchjunà %@ quandu un situ hè apertu :

source: Long press on the Home screen until the icons start to jiggle.
co: Longa incalcata nant’à u screnu d’accolta fine à chì l’icone principianu à tremulà.

source: Make %@ your default to protect your data with every link you open.
co: Fate di %@ u vostru navigatore predefinitu per prutege i vostri dati à l’apertura d’ogni liame.

source: Manage Sites
co: Urganizà i siti

source: May break some videos and Web pages
co: Pò impedisce certe video è pagine web d’affissassi currettamente

source: %@ may install and run studies from time to time.
co: %@ pò installà è lancià studii di quandu in quandu.

source: More Settings
co: Altre preferenze

source: More than just incognito
co: Più chè solu incognitu

source: Mozilla strives to collect only what we need to provide and improve %@ for everyone.
co: Mozilla face casu di cullettà solu i dati chì sò ghjuvevule per rigalà è amendà %@ per tutti.

source: My Sites
co: I mo siti

source: Name to display
co: Nome à affissà

source: New Custom URL added.
co: L’indirizzu web persunalizatu novu hè aghjuntu.

source: New Search Engine Added.
co: U mutore di ricerca novu hè aghjuntu.

source: No Custom URLs to display
co: Nisunu indirizzu persunalizatu à affissà

source: Ok
co: Vai

source: OK, Got It!
co: Iè, aghju capitu !

source: Open device settings
co: Aprite i parametri di l’apparechju

source: Open Favorite Site
co: Apre u situ favuritu

source: Open in %@
co: Apre in %@

source: Open in Chrome
co: Apre in Chrome

source: Open in Default Browser
co: Apre in u navigatore predefinitu

source: Open Link
co: Apre u liame

source: Open Maps
co: Apre Cartugrafie

source: Open Settings App
co: Aprite i parametri

source: Page Actions > Request Desktop Site
co: Azzioni di a pagina > Fighjà a versione urdinatore

source: Paste or enter search string. If necessary, replace search term with: %s.
co: Incullate o stampittate una catena di ricerca. S’ellu hè bisognu, rimpiazzate u termine di ricerca da : %s.

source: PERFORMANCE
co: PERFURMENZE

source: PRIVACY
co: CUNFIDENZIALITÀ

source: Protection at your own discretion
co: Prutezzione discreziunale

source: Protections are OFF for this session
co: E prutezzioni sò disattivate per sta sessione

source: Protections are ON for this session
co: E prutezzioni sò attivate per sta sessione

source: %@ puts you in control.
co: %@ vi aiuta à stà à e cumande.

source: Rate %@
co: Valutà %@

source: Read more about this and other updates to %@.
co: Sapene di più nant’à stu rinnovu è ancu d’altri per %@.

source: Rename Shortcut
co: Rinuminà l’accurtatoghju

source: Re-Record or Delete Shortcut
co: Arregistrà torna o squassà l’accurtatoghju

source: Restore Default Search Engines
co: Risturà i mutori di ricerca predefiniti

source: SAFARI INTEGRATION
co: INTEGRAZIONE SAFARI

source: SEARCH
co: RICERCA

source: Search and browse right in the app
co: Fate ricerche è navigate in l’appiecazione

source: Search for %@
co: Circà %@

source: Search for %@. Then choose a widget.
co: Ricercate %@. Eppò sciglite un widget.

source: Search in %@
co: Circà in %@

source: Searching for something different? Choose a different search engine.
co: Ricercate qualcosa di sfarente ? Sciglite un altru mutore di ricerca.

source: SECURITY
co: SICURITÀ

source: Select Add to Shortcuts from the %@ menu
co: Selezziunate « Aghjunghje à l’accurtatoghji » da u listinu di %@

source: Select Safari, then select Extensions
co: Selezziunate Safari, eppò Estensioni

source: Set links from websites, emails and messages to open automatically in %@.
co: Definisce chì i liami di i siti web, i currieri elettronichi è i messaghji s’aprinu autumaticamente in %@.

source: Share Page With...
co: Sparte a pagina cù…

source: Shortcut removed
co: Accurtatoghju cacciatu

source: Show Me How
co: Fatemi vede cumu fà

source: Show Search Suggestions?
co: Affissà e suggestioni di ricerca ?

source: “Siri, erase my %@ session.”
co: « Siri, squassa a mo sessione %@. »

source: “Siri, open my favorite site.”
co: « Siri, apre u mo situ preferitu. »

source: SIRI SHORTCUTS
co: ACCURTATOGHJI SIRI

source: Site missing content or acting strange?
co: Ci seria u cuntenutu chì manca o u situ si cumpurteria d’una manera strana ?

source: Start a private search in %@ with your default search engine.
co: Principià una ricerca privata in %@ cù u vostru mutore di ricerca predefinitu.

source: %@ stopped this site from spying on you. Tap the shield for info on what we blocked.
co: %@ hà fermatu stu situ di spiunavvi. Picchichjate u scudu per cunnosce ciò ch’avemu bluccatu.

source: Take your private browsing to the next level.
co: Fate passà a vostra navigazione privata à u livellu superiore.

source: Tap on the plus icon.
co: Appughjate nant’à l’icona « + ».

source: Tap Safari, then select Content Blockers
co: Picchichjate nant’à Safari, eppò selezziunate « Blucchime di cuntenutu »

source: Tap the trash anytime to remove all traces of your current session.
co: Picchichjate a curbella à ogni mumenti per caccià tutta traccia di a vostra sessione currente.

source: That didn’t work. Try replacing the search term with this: %s.
co: Ùn hà micca funziunatu. Pruvate di rimpiazzà u termine di a ricerca da què : %s.

source: The Internet connection appears to be offline.
co: Pare chì a cunnessione internet ùn sia micca attiva.

source: This lets you save images to your Camera Roll
co: Què vi permette d’arregistrà e fiure in u vostru Rotulu di filmu

source: This lets you unlock the app.
co: Què vi permette di spalancà l’appiecazione.

source: To get suggestions, %@ needs to send what you type in the address bar to the search engine.
co: Per ottene suggestioni di ricerca, %@ hà bisognu di mandà à u mutore di ricerca ciò chì vo stampittate in a barra d’indirizzu.

source: Touch ID can unlock %@ if a URL is already open in the app
co: Touch ID pò spalancà %@ s’è un indirizzu web hè dighjà apertu in l’appiecazione

source: Trackers and scripts to block
co: Perseguitatori è scenarii à bluccà

source: Trackers blocked since %@
co: Perseguitatori bluccati dapoi u %@

source: %@ trackers blocked so far
co: %@ perseguitatori bluccati sin’avà

source: Tracking Protection off
co: A prutezzione contr’à u spiunagiu hè disattivata

source: Try turning off Tracking Protection
co: Pruvate di disattivà a prutezzione contr’à u spiunagiu

source: Turn on Face ID
co: Attivà Face ID

source: Turn on Touch ID
co: Attivà Touch ID

source: Unlock %@ when re-opening in order to prevent unauthorized access.
co: Spalancà %@ à ogni riapertura per impedisce tuttu accessu micca auturizatu.

source: URL to open
co: Indirizzu à apre

source: Use Face ID to unlock app
co: Impiegà Face ID per spalancà l’appiecazione

source: Use it as a private browser:
co: Impiegatelu cum’è un navigatore privatu :

source: Use it as a Safari extension:
co: Impiegatelu cum’è un’estensione Safari :

source: Use Touch ID to return to %@
co: Impiegà Touch ID per rivene nant’à %@

source: Use Touch ID to unlock app
co: Impiegà Touch ID per spalancà l’appiecazione

source: %@ wants to open another App
co: %@ vole apre un’altra appiecazione

source: %@ wants to open the App Store.
co: %@ vole apre l’App Store.

source: Want to see the full desktop version of a site?
co: Vulete fighjà a versione urdinatore cumpleta d’un situ ?

source: Welcome to Firefox %@!
co: Benvenuta in Firefox %@ !

source: We’ll leave you to your private browsing, but get a quicker start next time with the %@ widget on your Home screen.
co: Vi lasciemu à a vostra navigazione privata, ma principiate più prestu e prossime volte cù u widget %@ nant’à u vostru screnu d’accolta.

source: Why yes, we do have a fresh new look!
co: Hè vera, avemu un aspettu tuttu novu !

source: %@ will send what you type in the address bar to your search engine.
co: %@ manderà à u vostru mutore di ricerca ciò chì vo stampittate in a barra d’indirizzu.

source: “%@” Would Like to Access Your Photos
co: « %@ » vole accede à e vostre fotò

source: You are now leaving %@.
co: Avete da esce di %@.

source: You browse. %@ blocks.
co: Navigate. %@ blucca.

source: Your history doesn’t follow you
co: A vostra cronolugia ùn vi seguita micca

source: Your history is history
co: A cronolugia, ghjè una vechja storia

source: 12 hours
co: 12 ore

source: 15 minutes
co: 15 minuti

source: 1 hour
co: 1 ora

source: 1 minute
co: 1 minutu

source: 24 hours
co: 24 ore

source: 256-bit encryption
co: Cifratura 256-bit

source: 30 minutes
co: 30 minuti

source: 5 minutes
co: 5 minuti

source: Access logins saved to Firefox for desktop from your device
co: Accidite da u vostru apparechju à l’identificazioni di cunnessione arregistrate in Firefox nant’à l’urdinatore

source: App Version
co: Versione di l’appiecazione

source: Ask a Question
co: Fà una dumanda

source: AutoFill Instructions
co: Instruzzioni per u riempiimentu autumaticu

source: AutoFill your logins right from your browser or app.
co: Riempiite autumaticamente e vostre identificazioni di cunnessione direttamente à partesi da u vostru navigatore o a vostra appiecazione.

source: Auto Lock
co: Chjusura autumatica

source: A-Z
co: A à Z

source: Complete the following steps in order to use Lockwise as an AutoFill provider.
co: Cumplettate e tappe chì seguitanu per impiegà Lockwise cum’è urigine di u riempiimentu autumaticu.

source: CONFIGURATION
co: CUNFIGURAZIONE

source: %@ copied
co: %@ cupiatu

source: Copy value
co: Cupià u valore

source: %@ deleted
co: %@ squassatu

source: Delete this login?
co: Squassà st’identificazione di cunnessione

source: Deselect iCloud Keychain
co: Deselezziunate u Portachjavi iCloud

source: %@ disabled, install this browser to make it available
co: %@ hè disattivatu, installate stu navigatore per rendelu dispunibule

source: Disconnect %@
co: Disghjunghje %@

source: Disconnect %@?
co: Disghjunghje %@ ?

source: Done Syncing your logins
co: Sincrunizazione di e vostre identificazioni di cunnessione compia

source: Due to a recent app update, we will need you to sign in again. Apologies for the inconvenience.
co: Per via d’un rinnovu recente di l’appiecazione, ci vole à ricunnettavvi torna. Scusateci per stu penseru.

source: Easily fill usernames and passwords where you need them most.
co: Rinsignate facilmente i nomi d’utilizatore è parolle d’entrata induve ne avete u più bisognu.

source: Finish
co: Piantà

source: Finished updating AutoFill
co: Rinnovu di u riempiimentu autumaticu compiu

source: Firefox Lockwise will use Face ID to sign you in to the app.
co: Firefox Lockwise impiegherà Face ID per cunnettavvi à l’appiecazione.

source: How to Set up AutoFill
co: Cumu cunfigurà u riempiimentu autumaticu

source: In order to lock %@, a passcode must be set up on your device. Without a passcode, anyone who has your device can access the information saved here.
co: Per ammarchjunà %@, un codice d’accessu deve esse definitu nant’à u vostru apparechju. Osinnò, qualvogliasia chì hà st’apparechju pò accede à l’infurmazioni chì ci sò arregistrate.

source: Label
co: Etichetta

source: Learn how to edit this entry
co: Amparà à mudificà st’elementu

source: %@ lets you access passwords you’ve already saved to Firefox. To view your logins here, you’ll need to sign in and sync with Firefox.
co: %@ vi permette d’accede à e vostre parolle d’entrata chì voi avete dighjà arregistrate in Firefox. Per affissà e vostre identificazioni di cunnessione quì, ci vole à cunnettassi à Firefox è attivà a sincrunizazione.

source: Lock Now
co: Ammarchjunà subitu

source: Mozilla strives to only collect what we need to provide and improve %@ for everyone.
co: Mozilla face casu à cullettà solu i dati chì sò ghjuvevule per rigalà è amendà %@ à tutti.

source: No logins found.
co: Alcuna identificazione di cunnessione trova.

source: No matching logins.
co: Alcuna identificazione di cunnessione chì currispondi.

source: Notes
co: Note

source: Open the Settings app
co: Aprite l’appiecazione Preferenze

source: Open this web address in browser
co: Apre st’indirizzu web in un navigatore

source: Password: double tap to copy %@
co: Parolla d’entrata : picchichjà duie volte per cupià %@

source: Preferred Browser
co: Navigatore preferitu

source: Reauthentication Required
co: Nova autenticazione richiesta

source: Recent
co: Recente

source: Recently Used
co: Impiegati pocu fà

source: Reveal password in plaintext
co: Palisà a parolla d’entrata in chjaru

source: Select Lockwise
co: Selezziunate Lockwise

source: Select options for sorting your list of logins (currently %@)
co: Selezziunate l’ozzioni per classificà a vostra lista d’identificazioni di cunnessione (attualmente %@)

source: Select when to lock after a period of inactivity
co: Selezziunà quandu ammarchjunà dopu à una durata d’inattività

source: Select which browser use with Lockwise
co: Selezziunà u navigatore à impiegà cù Lockwise

source: Set Up AutoFill
co: Cunfigurà u riempiimentu autumaticu

source: Sign in Required
co: Autenticazione richiesta

source: Sort Logins
co: Classificà l’identificazioni di cunnessione

source: SUPPORT
co: ASSISTENZA

source: Sync between devices with secure 256-bit encryption
co: Sincrunizate i vostri apparechji cù una cifratura assicurizata à 256-bit

source: Syncing your logins
co: Sincrunizazione di e vostre identificazioni di cunnessione

source: Syncing your logins…
co: Sincrunizazione di e vostre identificazioni di cunnessione…

source: Sync timed out
co: Cumportu di sincrunizazione eccidutu

source: Tap into AutoFill Passwords
co: Picchichjate nant’à Riempie e parolle d’entrata

source: Tap into Passwords & Accounts
co: Picchichjate nant’à Parolle d’entrata è conti

source: This removes synced logins from %@, but will not delete your logins from Firefox.
co: St’azzione caccierà da %@ l’infurmazioni di cunnessione sincrunizate, ma ùn e squasserà micca da Firefox.

source: This will delete the entry from both %@ and Firefox.
co: St’azzione squasserà l’elementu da %@ è ancu da Firefox.

source: This will delete your Firefox Account information and all saved logins from %@.
co: St’azzione squasserà da %@ l’infurmazioni di u vostru contu Firefox è tutte l’identificazioni di cunnessione arregistrate.

source: This will unlock the app.
co: Quessu à da sbluccà l’appiecazione.

source: To make changes to your account, log in to your Firefox Account from any browser.
co: Per fà mudificazioni à u vostru contu, cunnettatevi à u vostru contu Firefox da qualsisia navigatore.

source: To see more logins here, you’ll need to save them to Firefox.
co: Per affissà più d’identificazioni di cunnessione quì, ci vulerà à arregistrale in Firefox.

source: To use Firefox Lockwise, you’ll need a Firefox Account with saved logins.
co: Per impiegà Firefox Lockwise, averete bisognu d’un contu Firefox cù identificazioni di cunnessione arregistrate.

source: To use %@, you’ll need a Firefox Account with saved logins.
co: Per impiegà %@, averete bisognu d’un contu Firefox cù identificazioni di cunnessione arregistrate.

source: Turn on AutoFill Passwords
co: Attivate Riempie e parolle d’entrata

source: Unlock the app with ease using Touch ID or Face ID
co: Sbluccate facilmente l’appiecazione cù Touch ID o Face ID

source: Unlock with Face ID
co: Sbluccà cù Face ID

source: Unlock with Passcode
co: Sbluccà cù u codice d’accessu

source: Unlock with Touch ID
co: Sbluccà cù Touch ID

source: unnamed entry
co: elementu senza nome

source: Updating AutoFill…
co: Rinnovu di u riempiimentu autumaticu…

source: Username: double tap to copy %@
co: Nome d’utilizatore : picchichjà duie volte per cupià %@

source: Web Address
co: Indirizzu web

source: Web address: double tap to open in browser %@
co: Indirizzu web : picchichjà duie volte per cupià %@

source: You must be signed in to %@ before AutoFill will allow access to passwords within it.
co: Ci vole à esse cunnettu à %@ per chì u riempiimentu autumaticu permette l’accessu à e parolle d’entrata ch’ellu cuntene.

source: You’re not using a passcode.
co: Ùn impiegate micca di codice d’accessu.

source: You should use a passcode to lock your device. Without a passcode, anyone who has your device can access the information saved here.
co: Duveriate impiegà un codice d’accessu per ammarchjunà u vostru apparechju. Osinnò, qualvogliasia chì hà st’apparechju pò accede à l’infurmazioni chì ci sò arregistrate.

source: %1 apps missing from list.
co: %1 appiecazione(i) assente nant’à a lista.

source: %1. Good connectivity
co: %1. Bella cunnettività

source: 1. Go to <a href="open-account">Create password</a> in your Mozilla account settings.
co: 1. Accidite à <a href="open-account">Creà una parolla d’intesa</a> in i parametri di u vostru contu Mozilla.

source: %1 Half-yearly
co: %1 à u semestru

source: %1 Half-yearly + tax
co: %1 à u semestru + e tasse

source: %1 is not secure. Click here to turn on VPN and secure your device.
co: %1 ùn hè micca sicuru. Fate un cliccu quì per attivà a VPN è assicurà u vostru apparechju.

source: %1 is not secure. Turn on VPN to secure your device.
co: %1 ùn hè mica sicuru. Attivà a VPN per assicurizà u vostru apparechju.

source: %1. Moderate connectivity
co: %1. Cunnettività muderata

source: %1/month
co: %1 à u mese

source: %1 Monthly
co: %1 à u mese

source: %1 Monthly + tax
co: %1 à u mese + e tasse

source: %1-month plan: %2
co: Prugramma per %1 mesi : %2

source: %1/month + tax
co: %1 à u mese + e tasse

source: %1. No connectivity
co: %1. Nisuna cunnettività

source: %1 of %2
co: %1 nant’à %2

source: %1 out of %2 devices added
co: %1 apparechji aghjunti nant’à %2

source: %1. Poor connectivity
co: %1. Cunnettività scarsa

source: %1 subscription
co: Abbunamentu %1

source: %1 to %2
co: Da %1 à %2

source: %1 Yearly
co: %1 à l’annu

source: %1 Yearly + tax
co: %1 à l’annu + e tasse

source: 2. Create a password.
co: 2. Create una parolla d’intesa.

source: 30-day money-back guarantee
co: Garanzia di rimborsu di 30 ghjorni

source: 3 tools, 1 privacy plan — VPN, email masking, and data protection
co: 3 attrezzi, 1 impegnu di cunfidenzialità — VPN, maschere di messaghjeria è prutezzione di i dati

source: 500+ servers in 30+ countries
co: Più di 500 servitori in più di 30 paesi

source: 7-day free trial
co: Prova di rigalu di 7 ghjorni

source: About us
co: Infurmazioni

source: A captive portal is when the guest Wi-Fi you are using requires you to log in to get internet access.
co: Un purtone cattivu si vede quandu u Wi-Fi d’ospite chì vò impiegate vi dumanda di cunnettevi per accede à Internet.

source: Access Apple CarPlay, AirDrop, AirPlay and local network devices like printers.
co: Accidite à Apple CarPlay, AirDrop, AirPlay è à l’apparechji di a reta lucale cum’è e stampette.

source: Access Apple CarPlay, AirDrop, AirPlay and local network devices like printers. The VPN must be off to edit this setting.
co: Accidite à l’Apple CarPlay, l’AirDrop, l’AirPlay è l’apparechji lucali di a reta cum’è e stampette. A VPN deve esse disattivata per mudificà stu parametru.

source: Access printers, streaming sticks and all other devices on your local network
co: Accede à e stampette, i canali di diffusione è à tutti l’altri apparechji di a vostra reta lucale

source: Access to service
co: Accessu à u serviziu

source: Account issues
co: Prublemi di contu

source: Active since
co: Attivu dapoi

source: Ad-blocking: Reduces the number of ads you see when you’re using VPN.
co: Blucchime di publicità : riduce u numeru di publicità affissate quandu s’impiegheghja a VPN.

source: Add application
co: Aghjunghje un’appiecazione

source: Add Application
co: Aghjunghje un’appiecazione

source: Add apps manually
co: Aghjunghje appiecazioni manualmente

source: Added %1 days ago
co: Aghjuntu %1 ghjorni fà

source: Added a few hours ago (%1)
co: Aghjuntu qualchì ora fà (%1)

source: Added less than an hour ago
co: Aghjuntu menu d’un’ora fà

source: Add even more privacy
co: Aghjunghjite ancu più di cunfidenzialità

source: Add Firefox Relay
co: Aghjunghje Firefox Relay

source: Adding and removing devices
co: Aghjuntu è cacciatura d’apparechji

source: Adding a new device to your subscription is easy: just download and log in to Mozilla VPN on that device.
co: Aghjunghje un apparechju novu à u vostru abbunamentu hè faciule : basta à scaricà Mozilla VPN è cunnittitevi via st’apparechju.

source: Advanced DNS settings
co: Preferenze DNS esperte

source: Advanced DNS Settings
co: Preferenze DNS esperte

source: Advanced tip
co: Astuzia d’espertu

source: Advanced tips
co: Astuzie d’espertu

source: A fast, secure and easy to use VPN. Built by the makers of Firefox.
co: Una reta privata virtuale (VPN) rapida, assicurizata è faciule à impiegà. Cuncepita da l’autori di Firefox.

source: Allow Mozilla VPN to automatically send crash reports to help fix unexpected crashes
co: Permette à Mozilla VPN di mandà autumaticamente i raporti d’accidente per aiutà à currege i prublemi

source: Allow Mozilla VPN to create a VPN connection
co: Permette à Mozilla VPN di creà una cunnessione

source: Allow Mozilla VPN to send technical data to Mozilla
co: Permette à Mozilla VPN di mandà i dati tecnichi à Mozilla

source: Allow Mozilla VPN to send technical data to Mozilla?
co: Permette à Mozilla VPN di mandà i dati tecnichi à Mozilla ?

source: Allow Mozilla VPN to send technical, interaction, and campaign and referral data to Mozilla
co: Permette à Mozilla VPN di mandà i dati tecnichi, d’interazzione, di campagna è di ricumandazione à Mozilla

source: Allow Mozilla VPN to send technical, interaction, and campaign and referral data to Mozilla?
co: Permette à Mozilla VPN di mandà i dati tecnichi, d’interazzione, di campagna è di ricumandazione à Mozilla ?

source: Allow on this device
co: Permette nant’à st’apparechju

source: Allow RCS/MMS messaging, Apple features like CarPlay and AirDrop, and connections to local devices. May reduce network security.
co: Permette a messaghjeria RCS/MMS, i funzioni Apple cum’è CarPlay è AirDrop, è e cunnessioni à l’apparechji lucali. St’ozzione pò riduce a sicurità.

source: Allow VPN connection
co: Permette a cunnessione VPN

source: Allow VPN to run in background
co: Permette l’esecuzione di a VPN in sfondulu

source: [all] Regular key rotation, improving security in the event of extreme, unexpected situations.
co: [tutti] Rutazione regulare di e chjave, amendendu a sicurità in casu di situazioni estreme è impreviste.

source: [all] Subscription management has fully transitioned to the Mozilla accounts website.
co: [tutti] A ghjestione di l’abbunamenti hè stata trasferita sana ver di u situ web di i conti Mozilla.

source: [all] You can use Mozilla VPN in dozens of languages, and we’ve included the latest translations in this release.
co: [tutti] Pudete impiegà Mozilla VPN in decine di lingue, è avemu inchjusu l’ultime traduzzioni in quella versione.

source: Already a subscriber?
co: Dighjà abbunata(u) ?

source: [Android] If you share logs when contacting support, they now include the device model and manufacturer to help us better help you.
co: [Android] Quandu vo cuntattate l’assistenza, i ghjurnali chì vo scumpartite inchjudenu avà u mudellu è u custruttore di l’apparechju per permetteci d’aiutavvi megliu.

source: [Android] Invisible work that will allow the app to run smoother on the latest devices.
co: [Android] Cambiamenti invisibile chì permitteranu à l’appiecazione un funziunamentu più fluidu nant’à l’apparechji recenti.

source: A new “My Devices” screen that makes it easier to view and manage your devices
co: Un screnu novu « I mo apparechji » chì rende più faciule l’affissera è l’amministrazione di i vostri apparechji
